let sum = 0;                                               // Ініціалізуємо змінну для зберігання суми чисел
for (let i = 1; i <= 100; i++) 
{                               // Цикл що проходить кожне число від "1 до 100"
    if (i % 3 !== 0) 
    {                                  // Перевіряємо, чи число не кратне "3"
        sum += i;                                        // Додаємо число до суми, якщо воно не кратне "3"

                                                           //(числа "1, 2, 4, та 5" не є кратними "3", тому вони будуть додані до суми. Коли "i" дорівнює "3 або 6",
                                                            // умова "i % 3 !== 0" буде "false", тому ці числа не додаються до суми.)
    }
}
console.log("Сума чисел від 1 до 100, які не кратні 3:", sum);        // Виводимо суму

